---
kind: enumMember
id: F:Autodesk.Revit.DB.MassDisplayTemporaryOverrideType.ShowMassSurfaceTypes
enum: Autodesk.Revit.DB.MassDisplayTemporaryOverrideType
source: html/b5a4d32d-0d3c-e17e-36b9-9a12914aae2e.htm
---
# Autodesk.Revit.DB.MassDisplayTemporaryOverrideType.ShowMassSurfaceTypes

Mass energy analysis surface subcategories (and Mass Floors) will be displayed.